[
    {
        "No": 1,
        "review comment": "We got this for my son who's going into middle school. The specs aren't the greatest, but it's a $100 phone. I'm not expecting flag ship specs. My son loves it. It's a little big for his hands, but that's what pop sockets are for. It's got really good batter life. He's constantly watching YT videos, and the batter lasts him the entire day.\n\nIt takes several minutes to reboot. That's very much so annoying. I thought the phone froze the first time I restarted it. I do like that it says 'Hello, Moto' when it finally turns on."
    },
    {
        "No": 2,
        "review comment": "The best part of this phone is it gets workable signal when others seem not to be able to do so.\n\nAny phone can run apps but most have lousy RF performance.  The RF performance of this phone seems to allow it to get a workable signal where other phones do not.  I was often in areas which seemed to have no to marginal coverage.  Now with this phone they all seem workable.  Casually comparing its performance to other kinds of phones in use in the same area by others on various networks, this phone will typically be able to make calls when others cannot.  It is clearly better than the phone it replaced.  Perhaps it is realted to Motorola being an old line radio company.  Who knows.  But it is a superior RF performer.\n\nI tested using different SIM cards and it works with both Verizon and T-Mobile (a GSM carrier) networks.  This is pretty unusual because most phones are either Verizon or GSM but not both.  The phone is advertised as working with ALL US carriers and this seems to be a good claim.  Maybe the thing is an SDR?  Wouldn't that be nice.\n\nThe wifi section has both 2.4 and 5 Ghz bands.  Both work very well.  Using a directional beam as the access point I was able to get a workable 2.4 link at about a half mile.  If you want to play with this I used a Ubiquiti Powerbeam PBE M2 400 which you can get on Amazon.\n\nThe phone is also very stable, having not yet crashed after a few months of use.  The phone comes with Android 11, which is very good and it will ask you to upgrade to 12.  Both versions are excellent and stable on this phone.  There are no hangs or crashes.\n\nThe memory holds all the apps I need and is only about 60% used.  Battery life can go way past two days if you are just on standby and have all the saver features turned on.  The two days is with \"normal\" use as in my kind of normal use versus playing games or watching video all day.  Charging is quite fast and considering you can run a day with far less than 100% battery, the time to refresh the battery is quite quick.\n\nThe camera is average, which in my case is good enough, but keep in mind it's a cell phone.  If you want to do real photography get a DSLR.\n\nFor the money you will not find a better deal.  There is no way I would pay $1200 for a phone especially when I can get 90% of the way there for 5% of the cost.\n\nMot has really done a great job.  I hope they keep up the great work because we need solid, good performing phones at this cost level.\n\nIf you want a phone that just works and does so very well and don't care about fashion, get this."
    },
    {
        "No": 3,
        "review comment": "Love this phone.  It runs very fast and really enjoy having a stylus for the first time.  Pros battery lasts a long time, games and streaming run amazingly, it stays connected a lot better to weaker wifi and cell signal than my previous phone, and its easy to switch from app to app.  The cons it comes with a lot of installed apps (I did know this from reviews before buying but still), general camera quality is sucky although it does have nice close up, and SD card cannot be formatted as internal.  It's a nice phone especially for the price just would have more memory had I know about the SD card."
    },
    {
        "No": 4,
        "review comment": "Moto G Stylus 2023: Terrible Disappointment\nI recently purchased the Motorola Moto G Stylus 2023, and I must say, it has been a complete disappointment in every aspect. This phone fails to deliver on its promises and falls short in terms of performance, design, and functionality. Here's why I strongly advise you to avoid this device:\n\nLackluster Performance: The Moto G Stylus 2023 is painfully slow and sluggish. It struggles to handle even basic tasks like opening apps or browsing the internet. The overall user experience is frustrating, and you'll find yourself waiting for ages just for simple actions to complete. It's as if the phone is stuck in the Stone Age!\n\nInferior Build Quality: The build quality of this phone is subpar at best. It feels cheap and flimsy in hand, lacking the premium touch you'd expect from a modern device. The materials used are of low quality, making it vulnerable to scratches and damage. Moreover, the design is uninspired and outdated, making the Moto G Stylus 2023 look like a relic from the past.\n\nMediocre Camera Performance: Despite the marketing hype surrounding its camera capabilities, the Moto G Stylus 2023 fails to deliver impressive results. The photos captured are often grainy, lack detail, and suffer from poor color accuracy. The supposed \"stunning\" low-light performance is nothing but a marketing gimmick, as the images turn out noisy and unusable. If you're looking for a phone with a good camera, this is definitely not the one.\n\nFrustrating Software Experience: Motorola's software experience on the Moto G Stylus 2023 is a nightmare. The device is loaded with bloatware, which not only eats up valuable storage space but also slows down the phone even further. The user interface is cluttered and unintuitive, making it difficult to navigate through the menus. Updates are infrequent, leaving users stuck with outdated features and security patches.\n\nLack of Display Quality: The display on the Moto G Stylus 2023 is a letdown. It lacks vibrancy, and colors appear washed out. The resolution is mediocre at best, resulting in a pixelated viewing experience. Whether you're watching videos, playing games, or simply browsing the web, the display fails to provide an immersive visual experience.\n\nIn conclusion, the Motorola Moto G Stylus 2023 is an absolute disappointment in every aspect. From its poor performance and inferior build quality to its underwhelming camera and frustrating software experience, this phone simply falls short of the competition. There are far better options available in the market at similar price points. Save yourself the trouble and look elsewhere for a reliable and feature-rich smartphone."
    },
    {
        "No": 5,
        "review comment": "The Moto G Play 2023 (unlocked) cost me $100  and serves as a great replacement for my UlePhone  P13 with Andriod version 11. The Ulephone had failed due to a leaky battery.\nThe Moto G was easy to set up. First, I opened up the box and noted that the user manual had a \"quick start\" manual that was too brief.  As per the quick start leaflet I put in the memory card and the sim card from my old phone. The battery showed a 60% charge so I immediately shut down the phone and charged it up to 100%.  Meanwhile I did a search for \"Moto G Play 2023 User Manual\" and downloaded the 62 page  (very useful) \"User Guide.\"  Be sure to get this manual (is is a pdf file) and it is full of  information.  The old SDcard needed to be reformatted and this manual tells how to do this. The Moto G has an Andriod 12 operating system and has \"VOLTE\" which is a requirement in our area for using the local AT&T cell towers.\nVOLTE give you more range and greater clarity than the old communications protocol. After about 90 minutes of charging I was at 100% and I did the initial; startup procedure  described in the downloaded manual.  The phone connected to the AT&T tower with no problems.  I made my first phone call and the sound level was more than adequate.  I have a hearing disability so I expect most people would say that the phone is 'loud.\"  I also downloaded a Kindle book  ($2.99)  that told me details about using Android 12. If you want the book  do a search on the Amazon site for \"Android 12 user manual\".  Most people will not get this manual but I am happy to have the extra information provided in this well-written book about the Android 12 OS.  I bought the Moto play because I needed a phone and did not care about playing games, reading kindle books, or \"living on the phone.\"  The Moto G can do all of that but you would be better off to buy a much more advanced unit that costs several time as much as the Moto G.  I much prefer using a separate (large) Kindle for reading, a  dedicated gaming computer,  and  desktop computer with multiple screens for other activities.  Overall, the Moto G does exactly what I wanted (a good phone)  at a reasonable price.  I also downloaded a few apps from the app store and they worked properly.  I rate this phone as being better than expected and well worth the low price."
    },
    {
        "No": 6,
        "review comment": "I've been using this phone for about nearly a year now, the fingerprint sensor stopped working and resigering my fingerprint within 6 months of having this phone and the camera is Honestly pretty blurry in general unless you get very close and personal with what your photographing. The phone turns on and works fine for calls and scrolling Instagram. However with games, streaming music, watching YouTube and or texting or typing, it lacks a bit. The keyboard is either slow to react, doesn't type at all, or \"ghost types\" (Registers your typing but you can't see what your typing) or all three. It can freeze up and be stuck on one page for a while too, it can take up to a solid 2 minutes and a half for it to start working again. It's terrible with games that require more then tapping and can crash really easily, same with streaming music and watching YouTube. It can also crash uploading photos to other websites (like profile pictures, things like that) it's a very buggy and finiky phone. The phone works as a phone but it lacks on so many aspects besides calling and speakers. I'll also give it that It holds a charge for at least the full day. But with all the bugginess of it, it's just irritating to deal with to say the least. This phone is quite literally meh. It's a pick your poison situationship with this phone. Not bad but also not good, buy at your own risk I guess. I'm going back to Apple once I'm able to."
    },
    {
        "No": 7,
        "review comment": "I picked this phone specifically because, aside from needing a replacement for my broken phone, I wanted a stylus phone to play stuff on a DS emulator (and 3DS emulator but I can't find any settings other than downscaling it into ugly mode to get a good frame rate, but I wasn't really expecting that capability for this price.) for those that don't know, you need a pressure stylus to get good accuracy as that's what the DS uses, whereas third party phone stylus...es? Styli? Not sure the plural for that. But they are just rubber bumps at the end that mimic the capacitor touch of a finger. Been playing Trauma Center and the accuracy is nearly perfect, and what imperfections there are might be down to the game or emulator rather than the phone. My only real complaint, and an issue I've never really had before even on cheaper phones, is that it starts to lag as I type long blocks of text. Eventually being nearly unusable. I bypass this by just copypasting my current text into a notepad document each time the lag starts and then pasting the lot of it back when I'm done (had to do that once while typing this review) so I'm not sure what's up there. Otherwise great phone. Waited a few months to write review since it is refurbished and wanted to give it time."
    },
    {
        "No": 8,
        "review comment": "Phone works very well.  Stylus is a great add on for those with large fingers. Unfortunately it's the weak link in this phone. After just a short while the stylus broke. It is quite easily replaced (and was) but the lifespan of the original wasn't great. The phone may not be the fastest on the planet in games but does well enough. Photo quality is okay overall. Quite good in daylight, passable in low light.  Battery life is okay, usually makes it two days before needing a charge. Playing games for hours on days off tend to lower the battery life to just a day.\nPurchased to replace a Samsung S-10A and the Motorola is a better phone.  A small complaint that the Samsung app store isnt available on Motorola. One or two apps for phone themes were lost in the change over.  After a few days of searching apps equal to, or maybe in some ways better were found and installed.\n\nQuite happy with this phone."
    },
    {
        "No": 9,
        "review comment": "Ive had this phone for years now, but still wish I had done this sooner.\nThis was the first time ever buying a phone off Amazon. Every other phone Ive ever had came from a brick and mortar store...AT&T, T-Mobile, etc. I had decided to drop my overpriced cell provider and switch to Mint Mobile, and my partner told be about buying phones off Amazon. I was a bit skeptical, but it was a good decision.\nMore importantly, every phone I had before this was either an iPhone or Samsung. I ditched iPhone roughly a decade ago and switched to Samsung and have never regretted it as I love the android OS much more than the Apple software. This was the first time I would own a Motorola since the days of the flip phone. But I liked the price, I liked the options, and I decided Id try it out and return it if I didnt like it.\nI still have this phone today. I work as an Officer, and where my old iPhones and multiple generations of Samsungs have eventually been damaged and had to bite the dust, otterbox covers or no, this thing still doesnt even have a single scratch or crack. It has been dropped, scraped against the ground, kicked a couple times, and once time it was thrown across a parking lot (again, Officer...im not the one doing that lol), and in an honestly cheap case that isnt even perfectly molded to the phone it STILL hasnt come close to showing signs of damage. Still have the stylus too, which I also say is impressive.\nI know modern motos no longer have the same reputation they did in the flip phone and prior days, I know they do break and crack and all that...but this is a review for MINE, and if mine has withstood everything the day to day life of a guy who works as an Officer deep in the ghettos and hoods of the city and lives out deep in the country backwoods, then I can help but wonder what in the world some of these other people are doing with their motos to actually break them."
    },
    {
        "No": 10,
        "review comment": "Got this moto g play. To replace a Samsung g14 which I greatly disliked.  The battery life seems pretty good. The speaker phone is nice and loud Which is very important.  The screen brightness colors and clarity is not bad at all. The reception seems good and the Google Android UI is a bit cleaner less cluttered than Samsung. The only drawback I can notice is phone could be a bit smoother when browsing or turning on phone screen some lag at times. Overall not bad for the price. But definitely not a super smooth rocket. Perhaps motorola could do some updates for it to smooth those things out. Over all seems decent"
    }
]